Updates class diagram
